## 📋 Plan Result (scheduling)

### 🔄 Execution Steps

| Step | Status |
|------|--------|
| 🎨 **Format Check** | ✅ Passed |
| ✅ **Validation** | ✅ Passed |
| 🚀 **Init** | ✅ Passed |
| 📋 **Plan** | 🔄 Changes Detected |

🔄 **Infrastructure changes detected**

```
Plan: 7 to add, 0 to change, 0 to destroy.
```

### 📊 Resource Summary

| Type | Count |
|------|-------|
| ➕ **To Add** | 7 |
| 🔄 **To Change** | 0 |
| ❌ **To Destroy** | 0 |

<details><summary>📋 Show Full Plan Output</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
data.aws_security_group.fargate_sg: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
data.aws_iam_role.task_execution_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
data.aws_sns_topic.my_sns: Reading...
module.custom_nlb.module.nlb.data.aws_partition.current: Reading...
module.custom_nlb.module.nlb.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_iam_role.task_role: Reading...
data.aws_kms_key.my_kms: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
data.aws_vpc.myvpc: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 0s [id=Z006257634KDWA8TCRYLE]
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
<= read (data resources)
Terraform planned the following actions, but then encountered a problem:
# module.custom_cloudwatch.aws_cloudwatch_log_group.firelens will be created
+ resource "aws_cloudwatch_log_group" "firelens" {
+ arn               = (known after apply)
+ id                = (known after apply)
+ log_group_class   = (known after apply)
+ name              = "/aws/ecs/minecraft-firelens-logs"
+ name_prefix       = (known after apply)
+ region            = "ap-northeast-1"
+ retention_in_days = 14
+ skip_destroy      = false
+ tags_all          = (known after apply)
}
# module.custom_ecs.aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
+ arn      = (known after apply)
+ id       = (known after apply)
+ name     = "minecraft-test-cluster"
+ region   = "ap-northeast-1"
+ tags     = {
+ "environment" = "test"
+ "owners"      = "minecraft"
}
+ tags_all = {
+ "environment" = "test"
+ "owners"      = "minecraft"
}
+ configuration {
+ execute_command_configuration {
+ logging = "DEFAULT"
}
}
+ setting {
+ name  = "containerInsights"
+ value = "enabled"
}
}
# module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0] will be read during apply
# (config refers to values not yet known)
<= data "aws_iam_policy_document" "logs" {
+ id            = (known after apply)
+ json          = (known after apply)
+ minified_json = (known after apply)
+ statement {
+ actions   = [
+ "logs:CreateLogGroup",
+ "logs:CreateLogStream",
+ "logs:PutLogEvents",
]
+ effect    = "Allow"
+ resources = (known after apply)
}
}
# module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0] will be created
+ resource "aws_cloudwatch_log_group" "lambda" {
+ arn               = (known after apply)
+ id                = (known after apply)
+ log_group_class   = (known after apply)
+ name              = "/aws/lambda/user-action-filter-function"
+ name_prefix       = (known after apply)
+ region            = "ap-northeast-1"
+ retention_in_days = 0
+ skip_destroy      = false
+ tags_all          = (known a

... (content truncated due to length) ...

role" {
│
╵
╷
│ Error: reading SNS Topic (minecraft-test-sns-topic): empty result
│
│   with data.aws_sns_topic.my_sns,
│   on main.tf line 27, in data "aws_sns_topic" "my_sns":
│   27: data "aws_sns_topic" "my_sns" {
│
╵
╷
│ Error: reading KMS Key (alias/cwa/for_encrypt_sns_topic): couldn't find resource
│
│   with data.aws_kms_key.my_kms,
│   on main.tf line 31, in data "aws_kms_key" "my_kms":
│   31: data "aws_kms_key" "my_kms" {
│
╵
╷
│ Error: Invalid function argument
│
│   on variables.tf line 86, in locals:
│   86:   merged_decoded_yaml = merge([for f in var.env_files : yamldecode(file(f))]...)
│
│ Invalid value for "path" parameter: no file exists at "secrets.yaml"; this
│ function works only with files that are distributed as part of the
│ configuration source code, so if this file will be created by a resource in
│ this configuration you must instead obtain this result from an attribute of
│ that resource.
╵

exit status 1
ERROR: terraform invocation failed in ./.terragrunt-cache/YE01qm_OOdyZBB8xumDNc5aEB1U/_4MtXHYCWA2GAoCPiNJgp6-wA8E/scheduling stderr=
╷
│ Error: no matching EC2 VPC found
│
│   with data.aws_vpc.myvpc,
│   on main.tf line 1, in data "aws_vpc" "myvpc":
│    1: data "aws_vpc" "myvpc" {
│
╵
╷
│ Error: no matching EC2 Security Group found
│
│   with data.aws_security_group.fargate_sg,
│   on main.tf line 8, in data "aws_security_group" "fargate_sg":
│    8: data "aws_security_group" "fargate_sg" {
│
╵
╷
│ Error: reading IAM Role (ecs_tasks-minecraft-test-role): couldn't find resource
│
│   with data.aws_iam_role.task_role,
│   on main.tf line 15, in data "aws_iam_role" "task_role":
│   15: data "aws_iam_role" "task_role" {
│
╵
╷
│ Error: reading IAM Role (minecraft-test-ecs_tasks_execution-role): couldn't find resource
│
│   with data.aws_iam_role.task_execution_role,
│   on main.tf line 19, in data "aws_iam_role" "task_execution_role":
│   19: data "aws_iam_role" "task_execution_role" {
│
╵
╷
│ Error: reading SNS Topic (minecraft-test-sns-topic): empty result
│
│   with data.aws_sns_topic.my_sns,
│   on main.tf line 27, in data "aws_sns_topic" "my_sns":
│   27: data "aws_sns_topic" "my_sns" {
│
╵
╷
│ Error: reading KMS Key (alias/cwa/for_encrypt_sns_topic): couldn't find resource
│
│   with data.aws_kms_key.my_kms,
│   on main.tf line 31, in data "aws_kms_key" "my_kms":
│   31: data "aws_kms_key" "my_kms" {
│
╵
╷
│ Error: Invalid function argument
│
│   on variables.tf line 86, in locals:
│   86:   merged_decoded_yaml = merge([for f in var.env_files : yamldecode(file(f))]...)
│
│ Invalid value for "path" parameter: no file exists at "secrets.yaml"; this
│ function works only with files that are distributed as part of the
│ configuration source code, so if this file will be created by a resource in
│ this configuration you must instead obtain this result from an attribute of
│ that resource.
╵

ERROR: 1 error occurred:
	* [./.terragrunt-cache/YE01qm_OOdyZBB8xumDNc5aEB1U/_4MtXHYCWA2GAoCPiNJgp6-wA8E/scheduling] exit status 1```

</details>

### 🔗 Links

- 📊 **[View GitHub Actions Run](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16860471043)**
- 📦 **[Download Artifacts](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16860471043#artifacts)**
- 🔍 **[View Terragrunt Plan Job](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16860471043/job/comment-results)**

*📋 Plan executed at 2025-08-10T10:45:32.130Z | Environment: scheduling*